Autodesk.Revit.DB.ValueParsingOptions.GetFormatOptions
Gets the FormatOptions to optionally override the default settings in the Units class.
Remarks:
By default, the FormatOptions represents default formatting
(UseDefault is true) and the FormatOptions in the Units class will
be used.
Returns:
A copy of the FormatOptions.
Since:
2014

Autodesk.Revit.DB.ValueParsingOptions.SetFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions to optionally override the default settings in the Units class.
Remarks:
By default, the FormatOptions represents default formatting
(UseDefault is true) and the FormatOptions in the Units class will
be used.
formatOptions:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ValueParsingOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ValueParsingOptions.AllowedValues
The allowable range of values to be parsed.
The allowable range of values.  The default is All.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.ValueParsingOptions.#ctor
Creates a new ValueParsingOptions object with default settings.
Since:
2014

Autodesk.Revit.DB.ValueParsingOptions
Options for parsing strings into numbers with units.
Since:
2014